module.exports = {
  printWidth: 80, // Максимальная длина строки
  tabWidth: 2, // Ширина табуляции
  useTabs: false, // Использовать пробелы вместо табуляции
  semi: true, // Добавлять точку с запятой в конце строк
  singleQuote: true, // Использовать одинарные кавычки
  quoteProps: 'as-needed', // Обрамлять ключи объектов кавычками только при необходимости
  jsxSingleQuote: false, // Использовать двойные кавычки для атрибутов JSX
  trailingComma: 'all', // Добавлять запятую в конец последнего элемента в объектах и массивах
  bracketSpacing: true, // Добавлять пробелы внутри фигурных скобок
  arrowParens: 'always', // Добавлять круглые скобки вокруг единственного параметра стрелочных функций
  insertPragma: false, // Не вставлять специальные комментарии в файлы
};
